Config/InformationRegisters/РабочиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РабочиеСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Comment>Источник финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Comment>Код финансового обеспечения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КПС</Name>
					<Comment>Классификационный признак счета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/РабочиеСчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Проверяет, существует ли в списке рабочих счетов хотя бы один
// с заполненным ИФО
//
Функция НаличиеИФОВСписке() Экспорт 
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РабочиеСчета.ИФО КАК ИФО
	|ИЗ
	|	РегистрСведений.РабочиеСчета КАК РабочиеСчета
	|ГДЕ
	|	НЕ РабочиеСчета.ИФО = ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)");   
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции  

// Очищает реквизит "ИФО" во всех записях регистра "Рабочие счета".
//
Процедура ОчиститьИФОВРабочихСчетах() Экспорт
	
	НачатьТранзакцию();

	Попытка

		БлокировкаДанных = Новый БлокировкаДанных;
		БлокировкаДанных.Добавить("РегистрСведений.РабочиеСчета");
		БлокировкаДанных.Заблокировать();    
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	РабочиеСчета.Период КАК Период,
		|	РабочиеСчета.Организация КАК Организация,
		|	РабочиеСчета.ИФО КАК ИФО,
		|	РабочиеСчета.КФО КАК КФО,
		|	РабочиеСчета.Счет КАК Счет,
		|	РабочиеСчета.КПС КАК КПС,
		|	РабочиеСчета.Актуален КАК Актуален
		|ИЗ
		|	РегистрСведений.РабочиеСчета КАК РабочиеСчета");
		
		ТабРабочихСчетов = Запрос.Выполнить().Выгрузить();
		ТабРабочихСчетов.ЗаполнитьЗначения(ПредопределенноеЗначение("Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка"), "ИФО");
		ТабРабочихСчетов.Свернуть("Период, Организация,ИФО,КФО,Счет,КПС,Актуален");
		
		РабочиеСчета = РегистрыСведений.РабочиеСчета.СоздатьНаборЗаписей();
		РабочиеСчета.Загрузить(ТабРабочихСчетов);
		РабочиеСчета.Записать();

		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Не удалось очистить реквизит ""ИФО"" в рабочих счетах.'",
			ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(
			ИнформацияОбОшибке()));
			
		ВызватьИсключение;
	КонецПопытки;
		
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
